---
kind: property
id: P:Autodesk.Revit.DB.CurtainCell.PlanarizedCurveLoops
source: html/792fe81c-dba9-8f4e-9dd3-a770392f2097.htm
---
# Autodesk.Revit.DB.CurtainCell.PlanarizedCurveLoops Property

The planarized curve loops for cell boundaries. The boundaries can have more than one CurveLoop. Each item in the returned array represents a CurveLoop containing 3 or more than 3 edges.

## Syntax (C#)
```csharp
public CurveArrArray PlanarizedCurveLoops { get; }
```